from tkinter import Tk, Label, Button, PhotoImage, ttk, messagebox, Entry, END, Frame
import math
from random import randrange
window=Tk()
window.geometry("900x600")
window.title("NEO. Math helper")
window.resizable(False,False)
window["bg"]="#362b2b"
btn_start_0=Button(text="Погнали нахуй",command=lambda:build())
btn_start_0.place(height=60,width=250,x=255,y=230)
words=["Черная мамба","Богиня","Дизель","Оксана","Величко","Кабан","Шапка пума","Одежда","Пуля","Револьер","AUX-кабуль","Кабель","Свечка","Сумерки",
"Одежда","Село","Колхоз","Группа крови","Леон","Цой","Аргумент","Сочинение","Изолятор","Алмаз","Раствор","Вещество","Элемент","Галстук","Мелочь","Очки","Поведение","Конь","Пони","Единорог","Письмо","Счет","Футбол","Баскетбол","Пейнтбол","Воллйебол","Трамвай","Тройлебус","Автобус","Автомат","Галюцинация",
"Макдональдс","Монополия","Альяс","Покер","Бравлстарс","Морегнштерн","Место","Больница","Поликлиника","Прививка","Укол","Мужчина","Женщина","Нитка","Паутина","Роман","Дрифт","Халат","Петух","Кредит","Ипотека","Клоп","Оса","Пчела","Комар","Мошка","Муравей","Мусор","Рамка","Граница","Метро","Туман","Фары","Колёса","Машина","Рак","Достижение","Функция","Бедро","Почки","Пончик","Хмель","Лебедь","Носорог","Монгол","Спарта","Медик","Штурмовик","Сапер",
"Велосипед","Скейтборд","Клавиатура","Стикер","Точилка","Вязать","Религия","Краска","Блюда","Завтрак","Обед","Ужин","Полдник","Сон час","Чайпитие","Этаж","Бакенбарды","Градусник","Зеленый","Черный","Талант","Дар","Пророк","Чемодан","Хлыст","Меч","Щит","Доспех","Лыжи","Трамплин","Высота","Гипотенуза","Катет","Змея","Ведро","Дождь","Ураган","Тайфун","Буря","Смерч","Торанадо","Серп","Молот","Аппокалипсис","Катастрофа","Бритва","Кость","Трахея","Баблик","Квас","Дыра","Золото","Алмаз","Платина","Рубин","Изумруд","Пицца","Страус",
"Минор","Мажор","Тиран","Ошибка","Босс","Круг","Окружность","Церковь","Забор","Огород","Грядка","Помидор","Огурец","Костюм","Служба","Шпаргалка","Серый","Дверь","Улица","Проспект","Площадь","Периметр","Клад","Закладка","Бессоница","Перо","Птица","Пингвин","Эмо","Пила","Топор","Заточка","Подсказка","Проект","Честь","Цена","Сумма","Браслет","Мечта","Холст","Кисть","Тело","Факел","Шпага","Щель","Серебро","Линия","Коллега","Напарник","Товарищ","Салат",
"Наушники","Дальнобойщик","Самолет","Аттестат","Музыка","Техас","Степень","Раб","Бог","Европа","Азия","Северная Америка","Вопрос","Ответ","Род","Падеж","Душа","Карты","Тесто","Свадьба","Список","Лист","Бумага","Съезд","Явление","Экстрасенсы","Гадалка","Ведьма","Вдова","Пианино","Люстра","Гитара","Скрипка","Подъезд","Кусок","Веревка","Мыло","Бурундук","Тверк","Наркотики","Минута","Секунда","Час","Сутки","День","Утро","Год","Век","Земля","Меркурий","Венера","Мирный житель","Бородино","Пожар","Гроб","Марш","Старт","Финиш","Угол","Визитка","Штаб","Объявление","Талон","Карман","Сумка","Рюкзак",
"Свитер","Цилиндр","Тетраэдр","Бабочка","Селенка","Азбука Морзе","Звезда","Ноутбук","Созвездие","Мельница","Масса","Черепаха","Клоун","Скалка","Скакалка","Скалодром","Рай","Ад","Попытка","Пытка","Фонарь","Склонение","Парик","Общество","Толпа","Народ","Блокнот","Аэропорт","Вокзал","Погреб","Холодильник","Печь","Камин","Рубль","Евро","Доллар","Ладонь","Купец","Гости","Цвет","Свет","Радиация","Расписание","Надежда","Вера","Сон","Чулки","Колготки","Юбка","Марс","Юпитер","Сатурн","Уран","Нептун","Бог Янус","Зеркало","Работа","Класс","Кабинет","Черта","Биссектриса","Перекати-поле","Газета","Время","Расстояние","Скорость","Ускорение",
"Дружба","Оригами","Оригами","Пластилин","Пума","Корона","Атеист","Экскурсия","Миф","Легенда","Репа","Мигрень","Зубочистка","Медуза","Виноград","Вино","Тюрьма","Старик","Слово","Предложение","Строчка","Абзац","Текст","Произведение","Творчество","Страница","Обложка","Проблема","Решение","Колонна","Приставка","Знак","СИмвол","Традиция","Обряд","Ритуал","Фараон","Пирамида","Куб","Ромб","Трапеция","Тик ток","ВКонтакте","Facebook","Танцпол","Шоу","Ведущий","Мафия","Лайк","Чертеж","Проекция","Медиана","Береза","Платок","Палатка","Атака","Защита","Побег",
"Жулудок","Пляж","Тёща","Тесть","Тесто","Дыня","Кормушка","Валенки","Сапоги","Доллар","Сталкер","Муравьед","Этикетка","Допинг","Гоголь","Пушкин","Душа","Петербург","Москва","Камень","Грамота","Книга","Минус","Плюс","Образование","Разговор","Диалог","Монолог","Двор","Ряд","Столбец","Башня","Молчание","Тишина","Безмолвие","Создатель","Сила","Ловкость","Интелект","Дух","Привидение","Тайна","Секрет","Истина","Корень","Суффикс","Основание","Смех","Дед мороз","Санта клаус","Труба","Диван","Кофемашина","Копейка","Лада","Нокиа","ИКЕА","Магнат","Голос","Пирог","Внимание","Фисташки","Кокос","Пальма","Инфляция","Рана","Перелом","Инсульт","Инфаркт",
"Файл","Документ","Работодатель","Экзорцист","Осанка","Матрас","Капюшон","Портрет","Пейхаж","Долина","Шоколад","Чашка","Война","Камикадзе","Юмор","Детство","Отрочество","Юность","Персик","Абрикос","Товар","Мандарин","Апельсин","Пуговица","Пиджак","Каблуки","Зрачок","Ресницы","Брови","Тушь","Филе","Бульон","Щука","Лавочка","Дичь","Животное","Грибы","Растения","Кровь","Небо","Нёбо","Стена","Потолок","Вход","Выход","Костер","Спички","Зажигалка","Апплодисменты","Оплата","Перевод","Ворона","Слесарь","Лобзик","Лезвие","Керамбит","Стрелка","Животное","КУст","Белка","Суслик","Броненосец","Навозный жук","Чеченец","Сова","Дятел","Абсцисса","Ордината","Жена","Муж","Смокинг","Кофта","Свитер","Худи",
"Пачка","КОнфеты","Чупа-чупс","Звук","Вибрация","Трафик","Полоса","Тест","Конференция","План","Тундра","Замок","Секретарь","Бухгалтер","Менеджер","Маркетолог","Пример","Тариф","Агент","Елка","Новый год","Пасха","Рождество","Гром","Гроза","Тревога","Кнопка","Семена","Иуда","Гений","Шалава","Шлюха","Проститутка","Самовар","Шишка","Залупа","Яйца","Заря","Горение","Кипение","Плавление","Конденсация","Чикса","Шавка","Карта","Корабль","Лодка","Парусник","Якорь","Бритва","Жопа","Ревизорро","Питон","Паскаль","Алгоритм","Сортировка","Гора","Мясо","Лох","Вена","Сердце","Литтл Биг","Бонус","Спасибо","Метель","Вьюга"]
words_now_1=words
print(len(words))
names=["АУЕШНИКИ","Злые бобры","Балдежные моржы","Забивные коты","Отжималовка","Литературоведы","Феминистки","Овощное рагу","Анимешники","Балбесы","Победительницы","Волки","Шакалы","Гиены","Татары","Таджики","Черногорцы","Синии киты","Задроты","Мажоры","Цыгане","Спермотоксикозники","Мясники","Свирепые свиньи","Опасные грибы","Шаманы","Иуды"]
btn_start_0.destroy()
ent_1=Entry(font=("Calibri",20,"bold"),fg="#EC0033")
ent_1.place(height=70,width=350,x=100,y=150)
ent_2=Entry(font=("Calibri",20,"bold"),fg="#EC0033")
ent_2.place(height=70,width=350,x=100,y=350)
ent_time=Entry(font=("Calibri",30,"bold"),fg="#EC0033")
ent_time.place(height=70,width=150,x=100,y=450)
btn_start_1=Button(text="Приступить",command=lambda:get(),font=("Calibri",30,"bold"),bg="#f67300",fg="#362b2b")
btn_start_1.place(height=60,width=250,x=495,y=270)
lbl_command=Label(text="",font=("Calibri",30,"bold"),fg="#f67300",bg="#362b2b")
btn_start=Button(text="Начать",command=lambda:tick_1(),font=("Calibri",30,"bold"),bg="#f67300",fg="#362b2b")
word_lbl=Label(text="",font=("Calibri",30,"bold"),fg="#f67300",bg="#463b3b")
btn_up=Button(text="Up",command=lambda:up(), bg="green",fg="black",font=("Calibri",30,"bold"))
btn_down=Button(text="Down",command=lambda:down(), bg="red",fg="black",font=("Calibri",30,"bold"))
lbl_time=Label(text="",font=("Calibri",30,"bold"),fg="#362b2b",bg="#f67300")
chet=0
chet_lbl=Label(text=chet,font=("Calibri",30,"bold"),fg="#EC0033",bg="orange")
lbl_command_1_chet=Label(text="",font=("Calibri",18,"bold"),fg="#EC0033",bg="orange")
lbl_command_2_chet=Label(text="",font=("Calibri",18,"bold"),fg="#EC0033",bg="orange")
time_now=0
ent_1.insert(1,names[randrange(0,len(names))])
ent_2.insert(1,names[randrange(0,len(names))])
command_first=""
command_second=""
chet_command_1=0
chet_command_2=0
command_now=""
time=0
def get():
	global command_first, command_second,command_now,lbl_command,txt_lbl_command_2,time
	command_1=ent_1.get()
	command_2=ent_2.get()
	time=int(ent_time.get())
	commands=[command_1,command_2]
	ent_time.place(x=905,y=605)
	ent_1.place(x=905,y=605)
	ent_2.place(x=905,y=605)
	btn_start_1.place(x=905,y=605)
	command_first=commands[randrange(0,2)]
	if command_first ==commands[0]:
		command_second=commands[1]
	else:
		command_second=commands[0]
	command_now=command_first
	txt_lbl_command_2=str(command_second)
	game_1()

def game_1():
        global command_first, command_second,command_now,lbl_command,chet,chet_command_1,chet_command_2,time_now
        lbl_command=Label(text="",font=("Calibri",30,"bold"),fg="#f67300",bg="#362b2b")
        lbl_command.place(x=450,y=10)
        time_now=0
        btn_start.place(height=60,width=250,x=360,y=270)
        txt_lbl_command=("Команда\n"+str(command_now))
        lbl_command.configure(text=txt_lbl_command)
        lbl_command_1_chet.place(x=5,y=5)
        lbl_command_2_chet.place(x=5,y=45)
        word_lbl.place(x=905,y=605)
	

def end_round():
        global chet, chet_command_1,chet_command_2,command_first,command_second, command_now,txt_lbl_command_2,words_now_1,words,txt_lbl_command_1,txt_lbl_command_2
        btn_up.place(x=905,y=605)
        btn_down.place(x=905,y=605)
        lbl_command.place(x=905,y=605)
        chet_lbl.place(x=905,y=605)
        lbl_time.place(x=905,y=605)
        words_now_1=words
        if command_now==command_first:
                chet_command_1+=int(chet)
                txt_lbl_command_1=str(command_first+" : "+str(chet_command_1))
        elif command_now==command_second:
                chet_command_2+=int(chet)
                txt_lbl_command_2=str(command_second+" : "+str(chet_command_2))
        lbl_command_1_chet.configure(text=txt_lbl_command_1)
        lbl_command_2_chet.configure(text=txt_lbl_command_2)
        chet=0
        chet_lbl.configure(text=chet)
        if command_now==command_first:
                command_now=command_second
                txt_lbl_command=("Команда\n"+str(command_now))
                lbl_command.configure(text=txt_lbl_command)
                game_1()
        elif command_now==command_second:
                command_now=command_first
                txt_lbl_command=("Команда\n"+str(command_now))
                lbl_command.configure(text=txt_lbl_command)
                game_1()


def tick():
        global time_now,time
        if time_now<time:
                time_now+=1
                lbl_time.configure(text=time_now)
                window.after(1000,tick)
        else:
                end_round()

def tick_1():
        btn_start.place(x=905,y=605)
        global time_now, words_now_1, words
        word_lbl.place(x=30,y=150,height=200,width=300)
        btn_up.place(height=100,width=250,x=540,y=170)
        btn_down.place(height=100,width=250,x=540,y=390)
        chet_lbl.place(x=50,y=400,width=60,height=70)
        lbl_time.place(x=355, y=300, width=150,height=70)
        word_now=words_now_1[randrange(1,len(words_now_1))]
        words_now_1.remove(word_now)
        words.insert(-1,word_now)
        word_lbl.configure(text=word_now)
        lbl_time.configure(text=time_now)
        tick()

def up():
        global chet, words_now_1
        chet+=1
        print(len(words))
        chet_lbl.configure(text=chet)
        word_now=words_now_1[randrange(1,len(words_now_1))]
        words_now_1.remove(word_now)
        words.insert(-1,word_now)
        word_lbl.configure(text=word_now)
def down():
        global chet, words_now_1,words
        chet-=1
        chet_lbl.configure(text=chet)
        word_now=words_now_1[randrange(1,len(words_now_1))]
        words_now_1.remove(word_now)
        words.insert(-1,word_now)
        word_lbl.configure(text=word_now)
	
window.mainloop()
